{
  "items": [{"title":"Drupal JSON:API GET, POST, PATCH and DELETE Samples","created":"Friday, November 8, 2019 - 15:15","field_search_description":"The API that the JSON:API module makes available is centered on Drupal\u0027s entity types and bundles. Every bundle receives its own, unique URL path, which all follow a shared pattern.","view_node":"\/blog\/drupal-jsonapi-get-post-patch-and-delete-samples"},{"title":"Create a slideshow using the ImageField Slideshow module","created":"Thursday, April 6, 2017 - 13:00","field_search_description":"The Imagefield Slideshow makes it easy to create a slideshow from just an image field.\nImagefield Slideshow module will provide a field formatter for image fields, so that if multiple images are uploaded to that particular image field and this formatter helps you to render those images as a slideshow.\nFor more details check out the Imagefield Slideshow project page.\n","view_node":"\/blog\/create-slideshow-using-imagefield-slideshow-module"},{"title":"Reverse Proxy \u0026 Setup Nginx as Reverse Proxy","created":"Wednesday, August 28, 2019 - 16:54","field_search_description":"An intermediary proxy service which takes a client request, passes it on to one or more servers, and subsequently delivers the server’s response to the client is Reverse Proxy\n","view_node":"\/blog\/reverse-proxy-setup-nginx-reverse-proxy"},{"title":"Courtship time - Make it memorable, ways to add some spice","created":"Thursday, August 29, 2019 - 13:01","field_search_description":"Finally you found a guy\/girl with whom you can\u0027t wait to start most excitement time of your life.. But you see lot of time for wedding and So you got lot of time to know each other even more better.. The Best you can do is make this time memorable ;)","view_node":"\/blog\/courtship-time-make-it-memorable-ways-add-some-spice"},{"title":"API security","created":"Friday, July 26, 2019 - 08:30","field_search_description":"API security is the protection of the integrity of APIs—both the ones you own and the ones you use, Web API security is concerned with the transfer of data through APIs that are connected to the internet. OAuth (Open Authorization) is the open standard for access delegation. It enables users to give third-party access to web resources without having to share passwords\n","view_node":"\/blog\/api-security"},{"title":"file_scan_directory() to moved to file_system service in Drupal 8.8.0","created":"Thursday, July 25, 2019 - 15:29","field_search_description":"file_scan_directory is deprecated and has been moved to the file_system service\n","view_node":"\/blog\/filescandirectory-moved-filesystem-service-drupal-880"},{"title":"India\u0027s first experimental geo-stationary communication satellite \u0027Apple\u0027 started working on this day in the history, which was launched on June 19, 1981","created":"Monday, July 22, 2019 - 08:09","field_search_description":"The Ariane Passenger Payload Experiment (APPLE) was ISRO\u0027s first indigenous, experimental communication satellite. It was launched into GTO (Geosynchronous Transfer Orbit) by the third development flight of ESA\u0027a Ariane vehicle from Kourou on June 19, 1981. It was boosted into Geo-synchronous Orbit (GEO) by apogee motor of ISRO, derived from fourth stage motor of SLV-3.","view_node":"\/blog\/indias-first-experimental-geo-stationary-communication-satellite-apple-started-working-day"},{"title":"The Origin of Coconut Tree","created":"Monday, July 22, 2019 - 08:19","field_search_description":"Let us enjoy reading this Hindu Mythological Story of The Origin of Coconut Tree. King Trishanku was a saintly man whose one great desire was to ascend bodily into heaven.He had once done a good turn to sage Vishwamitra and the sage decided to help him fulfill his desire.\n","view_node":"\/blog\/origin-coconut-tree"},{"title":"Configure Redis, Set \u0026 Get Cache key values from Redis in Drupal","created":"Friday, July 19, 2019 - 15:00","field_search_description":"Redis is an open-source, networked, in-memory, key-value data store that can be used as a drop-in caching backend for your Drupal, Add the Redis module from Drupal.org, Enable the module \u0026amp; Verify Redis is enabled.\n","view_node":"\/blog\/configure-redis-set-get-cache-key-values-redis-drupal"},{"title":"Forgotten Story Of Batukeshwar Dutt, A Revolutionary And Dear Friend Of Bhagat Singh","created":"Friday, July 19, 2019 - 08:21","field_search_description":"Remembering our freedom fighters and revolutionaries who ensured independence always inspires us. However, there are some personalities whose stories are not often told and end up being lost with time.","view_node":"\/blog\/forgotten-story-batukeshwar-dutt-revolutionary-and-dear-friend-bhagat-singh"},{"title":"The Wise Man","created":"Thursday, July 18, 2019 - 08:24","field_search_description":"People have been coming to the wise man, complaining about the same problems every time. One day he told them a joke and everyone roared in laughter. After a couple of minutes, he told them the same joke and only a few of them smiled.\n","view_node":"\/blog\/wise-man"},{"title":"Modules can now declare their Drupal 8 upgrade status","created":"Wednesday, July 17, 2019 - 17:06","field_search_description":"The Migrate Drupal UI module provides a web browser user interface for upgrading from Drupal 6 \/ 7 to Drupal 8. There is a pre-upgrade analysis which displays a list of legacy modules that will be upgraded and will not be upgraded. Included in those that will be upgraded are modules that do not need an upgrade, such as the Help module. In order for this analysis to be correct, some Drupal 8 modules must provide information in a MODULE_NAME.migrate_drupal.yml file in the module\u0027s migrations\/state directory.\n","view_node":"\/blog\/modules-can-now-declare-their-drupal-8-upgrade-status"},{"title":"Humorously Honest Comics Showing A Relationship In The First Month Vs A Year Later","created":"Tuesday, July 16, 2019 - 14:27","field_search_description":"Its evident that When you get into  relationship you attempt your level best to introduce yourself most ideal as. Particularly for young ladies, they don’t set out to meet their bf without make up and invested hours preparing. Be that as it may, when you discuss a long  haul association with this feeling, the energy just blurs.\n","view_node":"\/blog\/humorously-honest-comics-showing-relationship-first-month-vs-year-later"},{"title":"Objects returned by getMessageIterator() now include source and destination IDs","created":"Wednesday, July 3, 2019 - 17:03","field_search_description":"Each migration using a SQL-based id_map plugin has two database tables: a map table and a message table. Corresponding rows in the two tables have the same source_ids_hash value. Each row in the map table should have a corresponding row in the map table, but not not every row in the map table has to have a corresponding row in the message table.\n","view_node":"\/blog\/objects-returned-getmessageiterator-now-include-source-and-destination-ids"},{"title":"Vikari Nama Samvatsaram, 2019 Ashada Masam","created":"Tuesday, July 2, 2019 - 08:16","field_search_description":"Ashada masam (Nija Ashadamasam) is the 4th month in Telugu calendar of Andhra Pradesh \u0026amp; Telangana. In 2019, Ashada masam starts on July 3 and ends on August 1 as per the Telugu Panchangam. Similar dates are observed as Ashada masa in Kannada, Marathi, and Gujarat Amavasyant Chandramana Panchanga.","view_node":"\/blog\/vikari-nama-samvatsaram-2019-ashada-masam"},{"title":"Cache Set, Get and Invalidate per User in Drupal 7","created":"Wednesday, June 26, 2019 - 17:35","field_search_description":"How to Set, Get and Invalidate the caches per user in Drupal 7, this blog article will explain a brief of how to do such implementation on Drupal using the default drupal cache functions.","view_node":"\/blog\/cache-set-get-and-invalidate-user-drupal-7"},{"title":"Store Drupal logs on Amazon S3","created":"Monday, June 24, 2019 - 14:49","field_search_description":"Store Drupal logs on Amazon S3 via hook_watchdog, so that you can get rid of heavy logs on your drupal database and can later read from the S3.","view_node":"\/blog\/store-drupal-logs-amazon-s3"},{"title":"Run Simple test cases from terminal via Docker commands","created":"Monday, June 17, 2019 - 14:18","field_search_description":"Run Simple test cases from terminal via Docker commands\n","view_node":"\/blog\/run-simple-test-cases-terminal-docker-commands"},{"title":"Perform HTTP request in Drupal 7","created":"Thursday, June 13, 2019 - 10:32","field_search_description":"To Perform an HTTP request in Drupal 7 we can use \u0022drupal_http_request\u0022 function. This is a flexible and powerful HTTP client implementation. Correctly handles GET, POST, PUT or any other HTTP requests. Handles redirects.\n","view_node":"\/blog\/perform-http-request-drupal-7"},{"title":"AES Encrypt \u0026 Decrypt","created":"Tuesday, June 11, 2019 - 16:30","field_search_description":"Advanced Encryption Standard, where we use “AES-256” to encrypt the data with Cipher. Encrypt \u0026amp; Decrypt approach taken is “Cipher Block Chaining” method “AES-256-CBC”.\n","view_node":"\/blog\/aes-encrypt-decrypt"},{"title":"Sites Still Vulnerable to Drupalgeddon 2","created":"Wednesday, June 27, 2018 - 12:55","field_search_description":"Attackers are exploiting Drupalgeddon 2 critical vulnerability in Drupal to compromise systems \u0026amp; secretly turn them into malicious cryptocurrency mining machines like cryptojacking malware, mine for Monero.\nThe only side effects a victim might notice is that their system is running slower or doing more work than usual.\n","view_node":"\/blog\/sites-still-vulnerable-drupalgeddon-2"},{"title":"Secure Website running on Apache with Let\u0027s Encrypt on Linux","created":"Thursday, February 1, 2018 - 12:07","field_search_description":"Website security is generally most complicated and expensive task for every Linux admin. Let’s Encrypt is a free, automated, and open certificate authority that provides free X.509 certificates for Transport Layer Security encryption via an automated process. It\u0027s very complex process to install and add SSL certificate to a web server. Let\u0027s make it easier with the help of Let’s Encrypt. One can easily encrypt data of your website free of charge using Let’s Encrypt.\n","view_node":"\/blog\/secure-website-running-apache-lets-encrypt-linux"},{"title":"Encrpt and Decrypt text in the URL\u0027s","created":"Thursday, January 18, 2018 - 18:19","field_search_description":"Encrpt and Decrypt text in the URL\u0027s, In general, while Anonymous user\u0027s are given access to make some DB operations via UI, then important thing to make sure is its not hackable.. For this to make sure, minimum thing to do is encrypt the piece of text for the end user and decrypt back piece of text while doing the backend operation..","view_node":"\/blog\/encrpt-and-decrypt-text-urls"},{"title":"Composer in Drupal 8 - Manage dependencies","created":"Monday, October 23, 2017 - 11:32","field_search_description":"Install Modules\/Themes via Composer in Drupal 8\n","view_node":"\/blog\/composer-drupal-8-manage-dependencies"},{"title":"Installing \u0026 Setting up the Symfony Framework","created":"Monday, October 23, 2017 - 14:18","field_search_description":"How can we Install \u0026amp; Setup the Symfony Framework!!\n","view_node":"\/blog\/installing-setting-symfony-framework"},{"title":"Aegir on Docker - Develop, Test, With Easier Deployment.","created":"Sunday, September 3, 2017 - 17:00","field_search_description":"Aegir with Docker would be one of the brilliant option for Better Drupal Development and Faster Deployments.\nDocker, which solves the overhead of virtualization layer. And Aegir, which gives the best possible Drupal Multisite hosting.\n","view_node":"\/blog\/aegir-docker-develop-test-easier-deployment"},{"title":"Drupal 8 – If not Features, What??? Configuration Management..!","created":"Monday, July 31, 2017 - 08:37","field_search_description":"With Some Best Practices with Drupal 8\u0027s Configuration Management will help you to achieve packaging reusable functionality.\n","view_node":"\/blog\/drupal-8-if-not-features-what-configuration-management"},{"title":"Setup Multiple Drush version\u0027s on your machine, make Drupal maintenance easier","created":"Thursday, July 6, 2017 - 14:06","field_search_description":"How to setup Multiple Drush\u0027s in your machine, to manage the drupal 6, drupal 7 and drupal 8 sites..\n","view_node":"\/blog\/setup-multiple-drush-versions-your-machine-make-drupal-maintenance-easier"},{"title":"Drupal 8 - Introduction to Plugin System and how its awesome in Drupal 8?","created":"Monday, June 26, 2017 - 12:52","field_search_description":"Drupal 8, Introduction to Plugin System, and how plugin system is awesome in drupal 8?\n","view_node":"\/blog\/drupal-8-introduction-plugin-system-and-how-its-awesome-drupal-8"},{"title":"Drupal - simplytest.me, Evaluate Drupal Projects Online","created":"Thursday, June 15, 2017 - 08:50","field_search_description":"How to use simplytest.me, to evaluate drupal projects online?\n","view_node":"\/blog\/drupal-simplytestme-evaluate-drupal-projects-online"},{"title":"Drupal 7 - Apache Solr Search, How to setup and how to index?","created":"Monday, June 5, 2017 - 13:25","field_search_description":"Install Solr on the machine, Setup the Core, Install and Configure the Apache Solr Search module and do the Indexing..\n","view_node":"\/blog\/drupal-7-apache-solr-search-how-setup-and-how-index"},{"title":"Drupal 8 - Form API, options we have in #states ?","created":"Tuesday, May 30, 2017 - 18:46","field_search_description":"Drupal 8, Form API #states allow us to create form elements that change state (show, hide, enable, disable, etc.) depending on certain conditions\n","view_node":"\/blog\/drupal-8-form-api-options-we-have-states"},{"title":"Drupal 8 - Simple Redirect Module, Redirect from one url to another url.","created":"Saturday, May 27, 2017 - 15:40","field_search_description":"This is a light weight Drupal 8 Module provide User to have Redirects in the Website.\n","view_node":"\/blog\/drupal-8-simple-redirect-module-redirect-one-url-another-url"},{"title":" Why DevOps is important? How this can be done in Drupal?","created":"Friday, May 12, 2017 - 12:31","field_search_description":"This video will give you a brief idea about the 2 questions..!","view_node":"\/blog\/why-devops-important-how-can-be-done-drupal"},{"title":"Integrating Codeception with Drupal to have added support for TDD","created":"Sunday, March 26, 2017 - 14:53","field_search_description":"Getting Codeception into Drupal, will have added support for TDD.. Specifically in having the Acceptance Tests in the project. And more over internal team and vendor team would be having more Confidence in the version releases of their project.\n","view_node":"\/blog\/integrating-codeception-drupal-have-added-support-tdd"},{"title":"Drupal 7 Performance Optimization Options and Checklist","created":"Saturday, July 4, 2015 - 09:44","field_search_description":"As great as Drupal 7 core can be, it doesn\u0027t scale well for Web sites with a lot of content and\/or a lot of users. To make it perform better under these scenarios, it\u0027s necessary to make use of several strategies, tools and techniques.","view_node":"\/blog\/drupal-7-performance-optimization-options-and-checklist"},{"title":"Install Apache, MySQL, PHP stack on Ubuntu 14","created":"Saturday, July 4, 2015 - 19:01","field_search_description":"In this artilce, we\u0027ll get a LAMP stack installed on an Ubuntu 14. Ubuntu will fulfill our first requirement: a Linux operating system. you just need to require to follow the steps.","view_node":"\/blog\/install-apache-mysql-php-stack-ubuntu-14"},{"title":"Auto Tagging of Taxonomy terms in Drupal7","created":"Sunday, September 27, 2015 - 19:54","field_search_description":"This article help you to create the way to implement the autotagging of the taxonomy terms based on the other field of the node page.","view_node":"\/blog\/auto-tagging-taxonomy-terms-drupal7"},{"title":"Setup the Drupal 8 site in the Pantheon instance","created":"Wednesday, March 22, 2017 - 15:30","field_search_description":"This video will show you, like how to setup Drupal 8 site in the Pantheon server..!","view_node":"\/blog\/setup-drupal-8-site-pantheon-instance"},{"title":"Drupal Multisite development environment Configuration in Ubuntu14","created":"Wednesday, July 8, 2015 - 06:54","field_search_description":"This article describes the minimum required steps for configuring a multisite development environment on a Ubuntu machine. The steps go through how to set up two development sites with the names testsite and testsite2.","view_node":"\/blog\/drupal-multisite-development-environment-configuration-ubuntu14"},{"title":"Create Related Content of Different Content Types through Taxonomy in Drupal7","created":"Saturday, July 11, 2015 - 18:09","field_search_description":"To have the content on the particular node of other content type or same content type, and which are related through the taxonomy term. this article helps you to create achive this.","view_node":"\/blog\/create-related-content-different-content-types-through-taxonomy-drupal7"},{"title":"Filter content between Date ranges in Drupal7","created":"Saturday, July 11, 2015 - 17:18","field_search_description":"It is tempting to believe that using the \u0022is between\u0022 on a date fields will work. However, this option is used only in the case of events \u0022Starting\u0022 on a rage of date. This article describes about how to filter the content between range of two dates. this is quite tricky.","view_node":"\/blog\/filter-content-between-date-ranges-drupal7"},{"title":"Security Checklist for Drupal","created":"Tuesday, February 14, 2017 - 17:34","field_search_description":"Checklist of the thing, which would help you to find the security issues in drupal code\nLess Critical - Cross Site Scripting (XSS) like, Using strip_tags, Using check_markup and Access Bypass related and Moderately Critical - Multiple vulnerabilities like Using filter_xss etc.\n","view_node":"\/blog\/security-checklist-drupal"},{"title":"Simple Redirect upon Registration and Login in Drupal8","created":"Thursday, March 16, 2017 - 08:02","field_search_description":"A light weight Module provide us simple redirection feature upon Registration and Login.\n","view_node":"\/blog\/simple-redirect-upon-registration-and-login-drupal8"},{"title":"Creating a Twitter Share block programmatically in Drupal 8","created":"Tuesday, March 14, 2017 - 10:55","field_search_description":"To Create a Twitter Share block programmatically in Drupal 8. And few minor stuff like Accessing the Current Node data in Block and How do we create the link programmatically..\n","view_node":"\/blog\/creating-twitter-share-block-programmatically-drupal-8"},{"title":"Configuring \u0026 Debugging Drupal 7 on PHPStorm with XDebug on Ubuntu14","created":"Wednesday, August 26, 2015 - 23:20","field_search_description":"Debugging the code is one of the important process for a developer, So now this article will help you to configure the Phpstorm for debugging the Drupal 7 application with the help of xDebug.\n","view_node":"\/blog\/configuring-debugging-drupal-7-phpstorm-xdebug-ubuntu14"},{"title":"Creating Drupal 7 hooks","created":"Friday, September 18, 2015 - 18:17","field_search_description":"Drupal’s hook system allows modules to interact with and alter the data of other modules (even Drupal core).\nTo use a hook system one should create it (and call the implementations (invoking)) and implement it.\nBy reading this article you will have a solid understanding of hook concept.\n","view_node":"\/blog\/creating-drupal-7-hooks"},{"title":"Start Migrating Drupal 6 to Drupal 7 - Migrate Module","created":"Saturday, September 26, 2015 - 20:23","field_search_description":"To develop custom migration processes based on the Migrate framework, you will need to create your own Migration classes in a custom module. and these will help you out in migrating D6 content to D7.\n","view_node":"\/blog\/start-migrating-drupal-6-drupal-7-migrate-module"},{"title":"Custom field formatter in Drupal 7","created":"Sunday, September 27, 2015 - 10:08","field_search_description":"This article is an example of how to add a field formatter to the field, this is been achieved through the field formatter hooks.\n","view_node":"\/blog\/custom-field-formatter-drupal-7"},{"title":"Creating simple headless Drupal 7 site - Headless Drupal","created":"Tuesday, August 18, 2015 - 23:26","field_search_description":"Headless drupal means, your web application front end will be your own html, javascript or any other front end framework, and the your web applications backend wiil be Drupal.\nThis article describes will describe how to achieve simple headless drupal application.\n","view_node":"\/blog\/creating-simple-headless-drupal-7-site-headless-drupal"},{"title":"Drush commands for Drupal Developers","created":"Sunday, July 5, 2015 - 19:51","field_search_description":"Few drush commands that a drupal developers should be aware of, which makes life of a drupal developer easy.\n","view_node":"\/blog\/drush-commands-drupal-developers"},{"title":"Drupal7 Simple Test case in Custom Module","created":"Sunday, July 12, 2015 - 07:58","field_search_description":"Knowing how to write tests is an important skill in drupal, and being able to do it can help to increase the quality of code, and save time by checking around your site to make sure things still work after making changes. In this article we are using test framework comes with drupal.\n","view_node":"\/blog\/drupal7-simple-test-case-custom-module"},{"title":"Getting Started with Sass\/SCSS","created":"Saturday, July 25, 2015 - 18:42","field_search_description":"Unlike regular CSS, Sass’ SCSS is a real scripting language, with expressions, functions, variables, conditional logic, and loops. You don’t have to use all of these features to get some benefit out of Sass, but they’re there if you need them, and on large projects they can make complex or repetitive CSS much easier to write.\n","view_node":"\/blog\/getting-started-sassscss"},{"title":"Custom Batch processing in Drupal 7 to update Nodes - Batch API","created":"Monday, August 17, 2015 - 00:18","field_search_description":"Drupal\u0026#039;s batch API processing is very nice and provides few benifits, We can break long tasks into smaller batches, and by this we will be able to prevent maximum execution time errors.\n","view_node":"\/blog\/custom-batch-processing-drupal-7-update-nodes-batch-api"}]
}