{
  "items": [
    {
      "title": "GrandPitstop Bike Mobile Holder with Charger",
      "link": "https://amzn.to/2E1dTs2",
      "image": "https://images-na.ssl-images-amazon.com/images/I/61ImzlIQ3IL._SX679_.jpg",
      "price": "₹ 367.00",
      "desc": " - If you are looking for a compact mount for your mobile without the cookie cutter shape, you’ve found it x-grip expands to fit a wide range of phones while keeping all of your buttons accessible  <br/> - With spider grip you will never get lost on the road and you don’t need to worry about running out of battery on the go, the 5v 2a output can charge your mobile as fast as your mobile charger  <br/> - The clean and clever 4 legged design sports great holding power without hiding your smartphone behind foam pads and plastic, the cradle expands and contracts for perfect fit of most smart phones  <br/> - How to Use : Fix the Clamp on the handlebar,Adjust the mobile holder as per right angle of rider,Connect the charging wire to the battery,Connect the mobile on the mobile holder,Switch on charging. Blue light appears,Connect the mobile and check charging",
      "category": "Car and Motorbike"
    },
    {
      "title": "Chevik X-Grip Bike Mobile Holder with Charger Waterproof",
      "link": "https://amzn.to/349itPE",
      "image": "https://images-na.ssl-images-amazon.com/images/I/71dzmbxhKhL._SY879_.jpg",
      "price": "₹ 999.00",
      "desc": "✔️ WHY CHEVIK X-GRIP - If you are looking for a compact mount for your mobile without the cookie cutter shape, you’ve found it. X-Grip expands to fit a wide range of phones while keeping all of your buttons accessible.<br/>✔️ALWAYS CONNECTED - With X-Grip you will never get lost on the road and you don’t need to worry about running out of battery on the go. The 5V 2A output can charge your mobile as fast as your mobile charger.<br/>✔️ALWAYS SECURED - The clean and clever 4 legged design sports great holding power without hiding your smartphone behind foam pads and plastic. The cradle expands and contracts for perfect fit of most smart phones.<br/>✔️OUR QUALITY - Chevik X-GRIP is made of high strength composite and stainless steel with silicone rubber tips to hold the device firmly. All the material used make our product a complete shockproof and waterproof mount.<br/>✔️CHEVIK WARRANTY - We are driven to provide you a quality and reliable product. We provide 6 months replacement warranty against any manufacturing defects and lifetime customer support for all our products.<br/>",
      "category": "Car and Motorbike"
    },
    {
      "title": "realme Earbuds 2 in-Ear Wired with mic (Black)",
      "link": "https://amzn.to/38qaVLG",
      "image": "https://images-na.ssl-images-amazon.com/images/I/51F5%2BNiGOxL._SX569_.jpg",
      "price": "₹ 598.00",
      "desc": " - Enjoy the powerful 11.2mm bass boost driver which consist of multi-layer composite diaphragm, bringing you a deep and powerful, yet accurate bass response.<br/> - The inline remote features three tactile buttons and a mic, so you can control your music and videos, incoming calls, and even summon your voice assistant directly at the touch of a button.<br/> - A premium, reinforced braided jacket, and two evenly grooved TPU cables make for a design that is robust and durable.<br/> - Realme buds 2 features built-in magnets and a cable strap which are designed to provide the ultimate solution for neatly storing your earphones.<br/> - Add a touch of style to your music experience with the realme Buds 2. The matte, streamlined design looks elegant and attractive.<br/> - Warranty: Realme Buds 2 is covered under 6 months brand Warranty against any manufacturing defects",
      "category": "Electronics"
    }
  ]
}